Autodesk.Revit.Exceptions.InvalidPathArgumentException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InvalidPathArgumentException
The exception that is thrown when a method received a pathname as an argument, but the pathname is
illegal: too long, invalid characters, etc.